markup/code.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2017-12-01 Fri 07:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-12"><h1 class="title"></h1>
<nav class="navbar navbar-default">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1" aria-expanded="false">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://myglc2.github.io/emacsite/">emacsite</a>
        </div>
        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav">
                <li class="dropdown">
                    <a href="#" class="dropdown-toggle" data-toggle="dropdown" role="button" aria-haspopup="true" aria-expanded="false">About <span class="caret"></span></a>
                    <ul class="dropdown-menu">
                        <li><a href=" ../README.html ">README</a></li>
                        <li><a href=" ../about/gnumake.html ">Site Automation</a></li>
                        <li><a href=" ../about/menus.html ">Menu Generation</a></li>
                    </ul>
                </li>
                <li class="dropdown">
                    <a href="#" class="dropdown-toggle" data-toggle="dropdown" role="button" aria-haspopup="true" aria-expanded="false">Markup <span class="caret"></span></a>
                    <ul class="dropdown-menu">
                        <li><a href=" ../markup/code-markup.html ">Code</a></li>
                        <li><a href=" ../markup/images-markup.html ">Images</a></li>
                        <li><a href=" ../markup/headlines-markup.html ">Headlines</a></li>
                        <li><a href=" ../markup/inline-markup.html ">Inline</a></li>
                        <li><a href=" ../markup/lists-markup.html ">Lists</a></li>
                        <li><a href=" ../markup/literal-markup.html ">Literal</a></li>
                        <li><a href=" ../markup/paragraphs-markup.html ">Paragraphs</a></li>
                        <li><a href=" ../markup/tables-markup.html ">Tables</a></li>
                    </ul>
                </li>
              </ul>
          <ul class="nav navbar-nav navbar-right">
            <li><a href="../todo.html">Todo</a></li>
            <li><a href="https://github.com/myglc2/emacsite">GitHub</a></li>
          </ul>
        </div><!-- /.navbar-collapse -->
    </div><!-- /.container-fluid -->
  </nav>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Code</h2>
<div class="outline-text-2" id="text-1">
<a href="../markup/code.html"><button type="button" class="btn btn-primary"> Page </button></a>
<a href="../markup/code-markup.html"><button type="button" class="btn btn-primary"> Markup </button></a>
<a href="http://orgmode.org/manual/Working-With-Source-Code.html"><button type="button" class="btn btn-primary"> Doc </button></a>


<p>
You can display code and/or the results of code execution for many
<a href="http://orgmode.org/manual/Languages.html">languages</a>. 
</p>

<p>
Define an <code>add</code> code block:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp" id="add">(+ 1 2 3 4)
</pre>
</div>

<p>
Insert the result of calling the <code>add</code> code block:
</p>
<pre class="example">
10
</pre>

<p>
Define a <code>reverse</code> function:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">reverse</span> (list)
  (<span style="color: #a020f0;">let</span> (value)
    (<span style="color: #a020f0;">dolist</span> (elt list value)
      (<span style="color: #a020f0;">setq</span> value (cons elt value)))))
</pre>
</div>

<p>
Insert a block that uses <code>reverse</code> and displays the results:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(reverse (list 1 2 3 4))
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-right">4</td>
<td class="text-right">3</td>
<td class="text-right">2</td>
<td class="text-right">1</td>
</tr>
</tbody>
</table>

<p>
Call the <code>menu</code> code block in <code>header.org</code> to insert another copy of the menu:
</p>
<nav class="navbar navbar-default">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1" aria-expanded="false">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://myglc2.github.io/emacsite/">emacsite</a>
        </div>
        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav">
                <li class="dropdown">
                    <a href="#" class="dropdown-toggle" data-toggle="dropdown" role="button" aria-haspopup="true" aria-expanded="false">About <span class="caret"></span></a>
                    <ul class="dropdown-menu">
                        <li><a href=" ../README.html ">README</a></li>
                        <li><a href=" ../about/gnumake.html ">Site Automation</a></li>
                        <li><a href=" ../about/menus.html ">Menu Generation</a></li>
                    </ul>
                </li>
                <li class="dropdown">
                    <a href="#" class="dropdown-toggle" data-toggle="dropdown" role="button" aria-haspopup="true" aria-expanded="false">Markup <span class="caret"></span></a>
                    <ul class="dropdown-menu">
                        <li><a href=" ../markup/code-markup.html ">Code</a></li>
                        <li><a href=" ../markup/images-markup.html ">Images</a></li>
                        <li><a href=" ../markup/headlines-markup.html ">Headlines</a></li>
                        <li><a href=" ../markup/inline-markup.html ">Inline</a></li>
                        <li><a href=" ../markup/lists-markup.html ">Lists</a></li>
                        <li><a href=" ../markup/literal-markup.html ">Literal</a></li>
                        <li><a href=" ../markup/paragraphs-markup.html ">Paragraphs</a></li>
                        <li><a href=" ../markup/tables-markup.html ">Tables</a></li>
                    </ul>
                </li>
              </ul>
          <ul class="nav navbar-nav navbar-right">
            <li><a href="../todo.html">Todo</a></li>
            <li><a href="https://github.com/myglc2/emacsite">GitHub</a></li>
          </ul>
        </div><!-- /.navbar-collapse -->
    </div><!-- /.container-fluid -->
  </nav>
</div>
</div>
</div></div></div>
</body>
</html>
